[{"title": "Overwhelming number of New Yorkers support changes to take mentally ill off streets, subways: poll", "summary": "Nearly 90% of New York City voters support expanding involuntary commitment and care of mentally ill residents roaming the streets or the subway, a new poll reveals.", "fullstory": "Nearly 90% of New York City voters support expanding involuntary commitment and care of mentally ill residents roaming the streets or the subway, according to a new poll.\nThe findings from the Association for a Better New York showed a staggering 88% of voters supported expanded treatment — as Gov. Kathy Hochul’s bid to expand the involuntary commitment laws is facing some resistance in the legislature.\n“Do you strongly support, somewhat support, somewhat oppose, or strongly oppose expanding the state eligibility standard for involuntary treatment and care to include individuals who are unable to care for themselves and meet their basic needs?” the survey asked.\nOf the 600 voters polled only 4% said they were opposed and 8% were undecided as support for change was overwhelming in all parts of the city and demographic groups.\nMore than nine in 10 voters (91%) also agreed with the statement that “it is more compassionate to provide involuntary treatment and care for people with severe mental illness than it is to leave them on the streets” — including a majority (53%) who strongly agree with that statement.\nSimilarly, 91% of voters agree that “people struggling with severe mental illness should not be denied life-saving psychiatric care because their illness prevents them from recognizing that they need help” — including 59% who strongly agree.\nThe poll — conducted by Tulchin Research for ABNY — also found that 73% of voters said that the number of public safety incidents in New York involving individuals with untreated severe mental illness has increased in recent years. Some 18% said the number has stayed the same, and just 4% said it has decreased.\n“New Yorkers are rightfully concerned about their safety,” said Steven Rubenstein, chairman of ABNY. “This isn’t just from watching the news. It is rooted in the firsthand experiences that New Yorkers are having in the transit system every single day.\n“There is an overwhelming consensus spanning every borough and every political party that we have a problem and there are compassionate ways to fix it,” Rubenstein added. “The proposed laws to better care for people who cannot care for themselves have the solid support of New Yorkers.”\nSome 86% of Big Apple residents said they’ve seen a person wandering on the street or in the subway who appears to be struggling with severe mental illness and unable to care for themselves.\nAbout nine in 10 voters believe it should be a top or high priority of New York State lawmakers to address untreated severe mental illness, the poll showed.\nNearly-two thirds of respondents said they have felt endangered while riding the subway or bus due to the actions of someone grappling with severe mental illness.\nA Hochul rep said she and the voters are in sync on wanting common sense solutions to help mentally ill residents get care while bolstering public safety. \n“Providing care to people facing significant health risks due to mental illness is a compassionate and humane approach that all New Yorkers can recognize. This is why there is overwhelming public support for Governor Hochul’s proposal,” spokesperson Avery Cohen said.\n“We look forward to working with the Legislature to enact these statutory changes and align New York with 43 other states that already have this in their laws. The cost of inaction is far too high.”\nIn its analysis, Tulchin Research said voters widely see involuntary care as “compassionate and necessary” to help those who can’t help themselves and believe that expanding the eligibility standard for involuntary care also protects public safety.\nDespite overwhelming public support, Hochul is facing some headwinds in Albany.\nThe state Assembly and Senate either entirely omitted or scrapped parts of Hochul’s bid to expand involuntary commitment laws in separate counter proposals to the governor’s budget plan released last week.\nThe lower chamber’s one-house budget proposal omits Hochul’s proposal around expanding the necessary criteria to compel mentally ill people into psychiatric care.\nBut it includes provisions for strengthening hospital discharge planning and requiring review panels after serious incidents where mentally ill people fall through the cracks or harm others.\nMany mental health care advocates and civil activists also oppose forced treatment, but others including Assembly Speaker Carl Heastie said there could be room for acceptable compromise.\n“We want people to feel safe on the subways. Subways should not become temporary living places for people who have mental health issues,” Heastie said last week.\nTulchin Research conducted the ABNY survey among 600 voters in New York City from Feb. 4-10. It has a margin of error of+/- 4 percentage points.", "link": "https://nypost.com/2025/03/16/us-news/overwhelming-number-of-new-yorkers-support-changes-to-take-mentally-ill-off-streets-subways-poll/", "image": "D:\\Desktop\\MyNews\\article_0.png"}, {"title": "US military shoots down Houthi drones as Trump’s strikes against terrorist group continue", "summary": "US warships have shot down roughly a dozen Houthi drones since President Donald Trump launched airstrikes against the terrorist organization on Saturday, according to a report.", "fullstory": "US warships have shot down roughly a dozen Houthi drones since President Donald Trump launched airstrikes against the terrorist organization on Saturday, Fox News has learned.\nA senior defense official told Fox News of the developments on Sunday.\nThe drones were aimed at the US Navy’s Truman Carrier Strike Group, and were shot down “well before” they posed a serious threat, the official added.\nThe latest military action came after nearly a year and a half of attacks from Houthis, both on commercial merchant vessels and US military ships.\nIn a Truth Social post on Saturday, Trump wrote that he had “ordered the United States Military to launch decisive and powerful Military action against the Houthi terrorists in Yemen.”\n“It has been over a year since a US-flagged commercial ship safely sailed through the Suez Canal, the Red Sea, or the Gulf of Aden,” Trump continued. “The last American Warship to go through the Red Sea, four months ago, was attacked by the Houthis over a dozen times.”\nTrump wrote that the “relentless assaults have cost the US and World Economy many BILLIONS of Dollars while, at the same time, putting innocent lives at risk.”\n“To all Houthi terrorists, YOUR TIME IS UP, AND YOUR ATTACKS MUST STOP, STARTING TODAY. IF THEY DON’T, HELL WILL RAIN DOWN UPON YOU LIKE NOTHING YOU HAVE EVER SEEN BEFORE!” his post concluded.\nTrump re-designated the Houthis as a foreign terrorist organization (FTO) in January. His first administration had named the Houthis as an FTO, but the Biden administration later reversed the move.\nOn Sunday, the White House released photos of Trump, Secretary of State Marco Rubio and National Security Adviser Mike Waltz monitoring the strikes.\n“President Trump is taking action against the Houthis to defend US shipping assets and deter terrorist threats,” the White House wrote on X. “For too long American economic & national threats have been under assault by the Houthis. Not under this presidency.” \nFox News Digital’s Danielle Wallace contributed to this report.", "link": "https://nypost.com/2025/03/16/us-news/us-military-shoots-down-houthi-drones-as-trumps-strikes-against-terrorist-group-continue/", "image": "D:\\Desktop\\MyNews\\article_1.png"}, {"title": "Trump ties for highest approval he’s ever had — as more Americans say US is on right track than any time in 20 years: poll", "summary": "The survey also found that voters generally feel Trump is bringing \"the right kind of change\" on the key issues — even tariffs.", "fullstory": "Three months into his second term, President Trump hit the highest approval rating he’s ever had as commander-in-chief — while more Americans say the country is on the right track than at any point since 2004, a new poll found.\nThat’s the good news, according to an NBC News Poll released Sunday.\nThe bad news is that Trump still has not won over a majority of Americans, and 54% said they disapprove of his handling of the economy — the first time he’s lost a majority on that issue in NBC’s poll.\nEven so, the survey found that voters generally feel Trump is bringing “the right kind of change” on the key issues — even tariffs.\nMore Americans support his changes to trade policy (41%) than oppose it (38%), according to NBC. \nThat’s despite the stock market selloff last week as Wall Street grappled with Trump’s decision earlier this month to slap 25% across-the-board tariffs on Canada and Mexico as well as a 20% tariff on China.\nOn many other key issues, voters felt the same way, with Trump’s actions on the border being the most popular — 56% said it was a positive change. On government cuts, 47% said his changes were good, compared to just 29% who opposed.\nEven on his handling of the Ukraine war and NATO — policies he’s received significant pushback on — more respondents said his actions were good — (41% and 40%) than opposed his actions.\nNBC poll respondents also appear to be cutting Trump some slack on inflation — 40% said his policies are having a positive effect, compared to 30% who said they were having a negative impact; 28% said Trump’s policies are not changing things at all.\nIllustrating how the president remains a political Rorschach test for a deeply divided country, Trump’s approval rating among Republicans is 90%, while his figures among Democrats clock in at a paltry 4%, per the poll.\nThat’s the largest gap in approval ratings between a president’s party and the opposition party over the last 80 years, NBC assessed.\nSome 47% of voters in the survey approve of Trump — compared to 51% who disapprove, marking an all-time high in the poll. He previously hit 47% in early 2020, just before the COVID-19 pandemic, and in October 2018. \nNBC News’ findings mirror most other polling, with the latest RealClearPolitics aggregate of polls showing Trump with a 48.2% approval rating on average.\nTrump’s approval rating is significantly higher than where it stood at this point during his first term (44%), per RCP, though below where former President Joe Biden was during the same time (53%). \nIn another boost for Trump, NBC News recorded that a two-decade high 44% of registered voters believe that the country is on the right track, while 54% believe it’s heading in the wrong direction. \nWhile still pessimistic, that marks the most positive outlook on the country’s direction the poll has found since President George W. Bush was in office 20 years ago.\nIt’s also a huge swing from the last administration. Last September, just 28% percent of polled voters told NBC News that the country was headed in the right direction — compared to 65% who said it was on the wrong track.\nOne of the most significant actions Trump has taken in his second term was to establish the Department of Government Efficiency (DOGE), something that has sparked protests from government workers and an outcry from Democrats. \nWhile DOGE is unpopular (47% negative to 41% positive), voters generally believe it was a good idea (46%), compared to 40% who say it was a bad idea to set up. \nTrump has steadfastly stood by DOGE and Elon Musk amid political backlash to the cost-cutting initiative, which is intended to help slim down the federal deficit. \nIn a key bright spot for Trump, Democrats’ favorability is at an abysmal 27%, with 55% viewing the party negatively, marking the worst numbers for the party in NBC News’ polling history.\nAnother poll from CNN found a similar result and also pegged Dems with their lowest rating in its polling history, with only 29% viewing the party favorably.\nAdditionally, voters also displayed skepticism of the media’s coverage of Trump, with 46% concluding it’s been too critical, while 25% felt it was too supportive, and 24% approved of the media’s approach to him.\nThe NBC News survey sampled 1,000 registered voters between March 7–11 with a margin of error of plus or minus 3.1 percentage points. ", "link": "https://nypost.com/2025/03/16/us-news/trump-hits-highest-approval-hes-ever-had/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fu-s-president-donald-trump-100474199_469338.jpg?w%3D1024"}, {"title": "Former NY Rep. Nita Lowey dead at 87, pol served 30 years in House", "summary": "Former Rep. Nita Lowey, who represented New York in Congress for 32 years and became the first woman to chair the House Appropriations Committee, died at 87, her family said. The Democrat – a staunch ally of former House Speaker Nancy Pelosi and friend of the Clintons – died Saturday at her home in suburban...", "fullstory": "Former Rep. Nita Lowey, who represented New York in Congress for 32 years and became the first woman to chair the House Appropriations Committee, died at 87, her family said.\nThe Democrat – a staunch ally of former House Speaker Nancy Pelosi and friend of the Clintons – died Saturday at her home in suburban Harrison after a years-long battle with metastatic breast cancer, according to a statement from her family obtained by CBS New York’s Tony Aiello.\n“Nita’s family was central to her life as she was to all of ours,” the statement said. “We will miss her more than words can say and take great comfort in knowing that she lives a full and purposeful life.”\nThe congresswoman was born Nita Sue Melnikoff in the Bronx in 1937 to a homemaker mother and accountant father, according to a lohud profile. \nShe graduated from the Bronx High School of Science and received a degree from Mount Holyoke College in 1959, her congressional bio stated.\nIn 1961, she was married to high-powered attorney Stephen Lowey and the family lived for a time in Queens, where they were neighbors to the Cuomos, the lohud profile stated. They moved to Harrison in 1981.\nLowey was first elected to Congress in 1988, serving three decades and 16 terms until 2020, when she retired as a representative for New York’s 17th Congressional District.\nAt her retirement she represented Westchester and Rockland counties, but due to reshaping of district lines over the years she had also represented parts of the Bronx and Queens during her tenure.\nShe became chair of the powerful House Appropriations Committee in 2019, after serving as a member in its ranks for years.\nDuring her time in Congress, she became an influential lawmaker backing liberal policies, including the law that requires companies to list allergens on food packaging. \nIn 1995, Lowey backed Public Television funding at the Appropriations Committee using Bert and Ernie hand puppets.\nAs chairwoman she clashed with President Trump over funding for the border wall and taking over during an extended government shutdown.\n“The president is an embarrassment and as a member of the Congress and as the leader of the appropriations committee, we have the responsibility to serve the people,” Lowey told lohud in 2019 after announcing her retirement.\nHouse Democratic Leader Hakeem Jeffries called Lowey ” principled, passionate and powerful public servant” in a tribute Sunday.\n“Over the course of her historic career, Congresswoman Lowey courageously served her constituents and stood up for New Yorkers while shattering multiple glass ceilings along the way,” Jeffries said in a statement, calling Lowey a “mentor and friend.”\nLowey is survived by her husband, three children and eight grandchildren, according to her family.", "link": "https://nypost.com/2025/03/16/us-news/ex-ny-rep-nita-lowey-dies-at-87-served-30-years-in-house/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F2020-file-photo-full-committee-19500194.jpg?w%3D1024"}, {"title": "Karoline Leavitt to skip White House Correspondents’ Association dinner", "summary": "White House press secretary Karoline Leavitt is planning to forgo the annual White House Correspondents’ Association (WHCA) dinner next month amid friction with the press corps.", "fullstory": "White House press secretary Karoline Leavitt will skip the annual White House Correspondents’ Association dinner next month after early friction with the press corps.\nLeavitt, who has clashed with the WHCA repeatedly over the past three months, ripped the association for running a “monetized monopoly” over White House reporting. \n“I will not be in attendance at the White House Correspondents’ Dinner, and that’s breaking news for ‘The Sean Spicer Show,’” Leavitt said on former White House press secretary Sean Spicer’s podcast Friday. \n“This is a group of journalists who’ve been covering the White House for decades,” she said. “They started this organization because the presidents at the time were not doing enough press conferences. I don’t think we have that problem anymore under this president.”\nThe WHCA, an association of journalists who cover the White House for an array of news outlets, was formed in 1914. \nUp until the second Trump administration, the WHCA had control over the rotation of White House pool reporters who get special access to the president.\nEvery year, the WHCA hosts a ritzy dinner for its correspondents and an assortment of famous guests. Usually the president attends the gala, but President Trump skipped it every year of his first administration.\nThe last time he attended, in 2011, then-President Barack Obama roasted him publicly and Trump has clashed with many of the top reporters in the WHCA.\nLast month, the White House began intervening in the selection of pool reporters, prompting outrage from the WHCA. Leavitt billed the undertaking as an effort to welcome new media voices to cover the administration. \n“They have not really welcomed other people, new media, independent journalists, with open arms, and so we thought it was time to expand the coverage and determine who gets to be part of that 13-person press pool, who gets to ask the president of the United States questions in the Oval Office, aboard Air Force One,” she said of the WHCA. \nThe Trump administration made room for a new media slot in the White House pool, in part, by narrowing down the print wire service spot to a single rotating position. Previously, the Associated Press, Bloomberg and Reuters had daily access to the pool.\nWHCA board president Eugene Daniel denounced the White House’s intervention in the pool reporter rotation, arguing it “tears at the independence of a free press in the United States.”\nThis year’s WHCA dinner is slated to take place on April 26 and will feature “Late Show with Seth Meyers” writer Amber Ruffin, who has publicly trashed Trump. \n“He’s missing out on one of the cool things about being the president of the United States. But I don’t know that anyone’s looking forward to being in the same room as him,” Ruffin jabbed on CNN last month. \nTrump has not publicly said yet whether or not he will attend, but is widely expected to skip the dinner. ", "link": "https://nypost.com/2025/03/16/us-news/karoline-leavitt-to-skip-white-house-correspondents-association-dinner/", "image": "D:\\Desktop\\MyNews\\article_2.png"}, {"title": "Jewish activists plan NYC protest against Schumer on day of his book launch: ‘Double-speak and failure to protect’", "summary": "The 74-year-old Jewish Democratic senator from New York is slated to release his tome \"Antisemitism in America: A Warning\" -- as the critics prepare to congregate outside an Upper East Side cultural center to protest what they say is his failure to pass the proposed Antisemitism Awareness Act.", "fullstory": "Jewish activists are planning a protest against Senate Minority Leader Chuck Schumer when his book warning of antisemitism is released Tuesday — with them accusing him of failing to help stop antisemitism.\nThe 74-year-old Jewish Democratic senator from New York is slated to release his tome “Antisemitism in America: A Warning” — as the critics prepare to congregate outside an Upper East Side cultural center to protest what they say is his failure to pass the proposed Antisemitism Awareness Act.\n“The only thing Chuck Schumer knows about Antisemitism is how to spread it,” Jewish activist Aliza Licht wrote in a statement.\n“The Jewish community will not allow Schumer to masquerade as the self-proclaimed ‘shomer of the Jews’ when he has fueled Antisemitism in America with his double-speak and failure to protect Jewish Civil Rights,” Licht said.\nSchumer, the highest-ranking Jewish official in the US, last year promised leaders in the community that he would attempt to pass the proposed Antisemitism Awareness Act to help curb antisemitism on campuses across the country.\nBut the effort stalled over disagreements between him and House Speaker Mike Johnson (R-La.) about how to push it through. Schumer wanted it tacked onto legislation such as the National Defense Authorization Act involving more money for the military, while Johnson sought for it to be a stand-alone vote, Axios reported.\nThe antisemitism bill would require the federal Department of Education to use the International Holocaust Remembrance Alliance’s definition of antisemitism when looking into potential violations of civil-rights law.\nThat definition cites examples of antisemitism as “drawing comparisons of contemporary Israeli policy to that of the Nazis,” “claiming that the existence of a State of Israel is a racist endeavor” and “applying double standards by requiring of [Israel] a behavior not expected or demanded of any other democratic nation.”\nDemocrats have splintered over the proposed act, with some, such as Manhattan Rep. Jerry Nadler (D-NY), who is Jewish, raising free-speech concerns about the policy.\nThe proposed act has since been reintroduced in the Senate by Sens. Jacky Rosen (D-Nev.) and Tim Scott (R-SC).\nThe activists planning Tuesday’s demonstration against Schumer in Manhattan say they also are angry with his response to the Trump administration’s efforts to deport anti-Israel activist Mahmoud Khalil — something that has been paused by the courts.\nKhalil, who has been staying in the US on a student visa, was a prominent student activist during the anti-Israel chaos that engulfed Columbia University last year.\nSchumer denounced Khalil’s behavior but demanded that the Trump administration properly “articulate any criminal charges or facts that would justify his detention or the initiation of deportation proceedings against him.”\n“I abhor many of the opinions and policies that Mahmoud Khalil holds and supports, and have made my criticism of the antisemitic actions at Columbia loudly known,” Schumer said on X in response to Khalil’s detention. \nBut “if the administration cannot prove he has violated any criminal law to justify taking this severe action and is doing it for the opinions he has expressed, then that is wrong, they are violating the First Amendment protections we all enjoy,” the senator said.\nSchumer’s forthcoming book is intended to deliver a “warning” based on history about the consequences of letting the “world’s oldest hatred” to go “unchecked.\nI abhor many of the opinions and policies that Mahmoud Khalil holds and supports, and have made my criticism of the antisemitic actions at Columbia loudly known. Mr. Khalil is also legal permanent resident here, and his wife, who is 8-months pregnant, is an American citizen.…\n“Obviously, with the great increase of antisemitism since October 7, it’s not past,” Schumer told NPR about hatred against Jewish people in the US. “And we have to make sure we have to be vigilant and push against it, fight against it all the way.”\nSchumer’s office did not return a Post request for comment.", "link": "https://nypost.com/2025/03/16/us-news/jewish-foes-plan-nyc-protest-against-schumer-on-day-of-book-launch/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F2025-washington-dc-wednesday-senate-100410239_6073d9.jpg?w%3D1024"}, {"title": "Putin ‘accepts the philosophy of President Trump’ on ending war in Ukraine: US special envoy", "summary": "Trump and Putin are set to discuss the cease-fire proposal this week, US Special Envoy Steve Witkoff told CNN's \"State of the Union\" on Sunday.", "fullstory": "Russian tyrant Vladimir Putin has indicated he “accepts the philosophy of President Trump’’ when it comes to ending the Ukraine war, and the pair will talk by phone this week, says US Special Envoy Steve Witkoff.\nThe US and Ukraine reached an agreement last week on a plan for a 30-day cease-fire to allow broader negotiations for an end to the war, a proposal that Russia refused to accept at the time. Trump and Putin are set to discuss the proposal this week, Witkoff told CNN’s “State of the Union” on Sunday.\n“I don’t want to put words in President Putin’s mouth, but I think he’s indicated that he accepts the philosophy of President Trump,” Witkoff told CNN’s “State of the Union” on Sunday, several days after he met with the Russian dictator. \n“President Trump wants to see an end to this. I think President Putin wants to see an end to this,” Witkoff said.\nThe US envoy met with Putin on Thursday for about four hours to discuss the war. The Russian leader has publicly stated that he agrees with the concept of pursuing a cease-fire but stopped short of backing Trump’s proposal unconditionally, caveating that there are “nuances.”\nMany observers believe that the Russians want a lot of the key issues decided in a cease-fire deal before agreeing to it even as a stop-gap measure. The Ukrainians, by contrast, have pushed for a quick cease-fire followed by negotiations for a broader agreement to end the war.\nOne of the key sticking points in ending the conflict has been control of the four key territories Russia has annexed since the war began three years ago: Donetsk, Luhansk, Kherson and Zaporizhzhia.\nMoscow still does not have total control over the four territories, despite its best efforts.\nWitkoff refused to directly answer when asked by CNN if the US would recognize Russian control over any of the territories it has seized, calling it “a little bit premature to get into that now.”\nUkrainian President Volodymyr Zelensky has been adamant that he won’t recognize Russian-occupied territory. \nTrump leaned hard on Zelensky to get the Ukrainians to back the cease-fire deal, with the White House even briefly freezing military aid and some intelligence-sharing to Ukraine.\nZelensky and Trump also famously clashed at the White House late last month over talks.\nAfter Ukraine agreed to the cease-fire proposal, the Trump administration restored military aid and intelligence-sharing to Kyiv.\nAhead of Trump’s forthcoming talk with Putin, the president said Gen. Keith Kellogg would serve only as his special envoy to Ukraine. Kellog previously served as an envoy for both Ukraine and Russia, though the Kremlin seemed wary of dealing with him.\n“General Kellogg, a Highly Respected Military Expert, will deal directly with President Zelensky and Ukrainian leadership,” Trump said Saturday.\nSecretary of State Marco also has talked with Russian Foreign Minister Sergei Lavrov about the next steps in the endeavor to end the war.\n“I think everybody has to focus on the progress that’s been made since the president was inaugurated,” Witkoff said of negotiations. “Nobody expected progress this fast. This is a very complicated situation, and yet we’re bridging the gap between two sides.”", "link": "https://nypost.com/2025/03/16/us-news/witkoff-says-putin-accepts-the-philosophy-of-president-trump-on-ending-the-war/", "image": "D:\\Desktop\\MyNews\\article_3.png"}, {"title": "Adrienne Adams’ bid for NYC mayor dealt major blow after campaign haul falls for matching funds: ‘Disadvantage’", "summary": "Council Speaker Adrienne Adams generated $128,000 in donations from supporters during the first week of her mayoral campaign -- but fell short of qualifying for public matching funds needed to substantially build up her warchest.", "fullstory": "Democrat Adrienne Adams raised $128,000 in the first week of her mayoral campaign but fell short of qualifying for public matching funds — in a major blow to her campaign.\nThe City Council speaker’s late entry into the race ahead of a June 24  party primary — and failure to immediately tap into the 8-1 public matching funds — makes her road to victory more difficult, campaign strategists said Sunday.\n“It certainly puts her at a disadvantage,” said Chris Coffey, who ran Andrew Yang’s mayoral campaign in 2021 and is supportive of ex-Gov. Andrew Cuomo’s comeback bid for City Hall.\nFormer Brooklyn Councilman Sal Albanese, who ran for mayor in 1997 and 2017, said, “You’re not a candidate unless you’re on TV.”\nHe said he qualified for taxpayer dollars just before the 1997 Democratic primary run.\n“My poll numbers shot up 12 points because I was able to put up TV ads. But it was too late. I got the funds a few weeks before the primary,” Albanese said.\nCandidates need to collect at least $250,000 in donations from 1,000 contributors to be eligible for matching funds, according to the city Campaign Finance Board — and Adams likely won’t get access to matching funds until May.\nStill, Albanese believes Adrienne Adams — no relation to rival Mayor Eric Adams — can be competitive because most voters don’t pay close attention until the final weeks before the primary.\nAdrienne Adams’ campaign team put out a positive memo Sunday claiming she has “big energy” despite the late start.\nShe raised more than $128,000 in five days from 1,128 donors, including 875 donors who reside in New York City.\nThe campaign said more than $78,000 in matchable donations qualify for $624,000 in matching funds, once the campaign qualifies.\n“This early surge reflects real, organic enthusiasm – something this race has largely lacked, aside from Zohran Mamdani’s base,” the campaign said.\nThey categorized Cuomo’s support as “passive” while hers is “active.” The Cuomo campaign is expected to report his campaign donations on Monday.\nAllies to the ex-governor have a Super PAC called Fix the City to independently bolster his campaign.\nBut some critics said the council speaker faces an uphill battle, with one Queens Democrat saying, “Adrienne would be a great alternative but she got into the race too late.”\nThe source said allies of the council speaker would have to set up a separate Super PAC, known as independent expenditure, to drump up the millions of dollars needed to go up against frontrunner Cuomo and other candidates.\nFour other contenders have obtained matching funds — city Comptroller Brad Lander, former Comptroller Scott Stringer, state Brooklyn state Sen. Zellnor Myrie and Queens Assemblyman Zohran Mamdani.\nThe CFB rejected Eric Adams matching funds due to ongoing legal woes, but he has raised $4.4 million.\nMeanwhile, Brooklyn Democratic Party chairwoman Rodneyse Bichotte Hermelyn — a close ally of Eric Adams — endorsed Cuomo.\nHer husband, Edu Hermelyn, works for the Cuomo campaign, The Post reported last week.\nIt’s a 180-turn for Bichotte, also a state assemblywoman, who on Aug. 3, 2021 said Cuomo should “step down and resign” as governor after a damning investigative report commissioned by state Attorney General Letitia James concluded he harassed or mistreated a slew of women.\nCuomo denied the accusations but resigned under threat of impeachment, and now is attempting a comeback bid for mayor.", "link": "https://nypost.com/2025/03/16/us-news/adrienne-adams-bid-for-nyc-mayor-dealt-major-blow-after-campaign-haul-falls-for-matching-funds-disadvantage/", "image": "D:\\Desktop\\MyNews\\article_4.png"}, {"title": "NYC health officials missed early COVID spread by following CDC bureaucrats: ‘Possibility we could have saved lives’", "summary": "It was a horrible place to be, wedged between the suspicion of cases and the inability to test them,'' said former city Health Department official Don Weiss.", "fullstory": "The city Health Department missed early detection of COVID-19 because it listened to CDC bureaucrats — losing the chance to potentially spare untold numbers from death, a former agency director claims.\nThe department’s leadership decided to strictly adhere to the federal Centers for Disease Control and Prevention’s rigid COVID-19 testing guidelines in early 2020, which delayed confirming the presence and transmission of the virus in the Big Apple by more than a month, writes Don Weiss in his new book, “Disease Detectives: True Stories of NYC Outbreaks.”\nWeiss, a former “surveillance director” for the Big Apple’s Department of Health, was monitoring the situation from the trenches at the time.\nHe said he was frustrated by CDC guidelines that limited testing to suspected infected patients who returned to the US from Wuhan, China, and elsewhere overseas, exhibited severe lower respiratory illness or were exposed to a known case. \nMany New Yorkers were only exhibiting mild, flu-like symptoms from COVID and would not be tested under the CDC criteria.\nThat meant they were potentially unaware that they had it — and more importantly, could infect others who were in poor health, immunocompromised or with serious pre-existing conditions or illness.\nAt a time without a vaccine, COVID turned into a death sentence for many elderly people and others with serious illness.\n“I worried that we’d miss the opportunity to prevent an onslaught,” Weiss said in the book of the limited testing.\n“By following the CDC’s strict criteria for testing we were missing cases. … The overwhelming probability favored mild cases arriving in NYC, but our hands felt tied.”\nHe said he and some others who tracked the disease wanted to test residents suspected of having even mild cases of COVID-19 to start a public health campaign sooner.\n“But we were voted down and we stuck to CDC’s criteria. … We needed to go off the CDC script,” wrote Weiss, 67, who directed the city DOH’s surveillance unit for 22 years.\n“It was a horrible place to be, wedged between the suspicion of cases and the inability to test them,” he said. “It was four weeks into the pandemic, and we still hadn’t identified a COVID-19 case in NYC, and the email to my colleagues imploring that we veer from CDC’s rigidity received zero response.” \nHe noted that Sharon Balter, a former department employee now working in the Los Angeles Health Department, was sending specimens to the CDC that didn’t meet the testing criteria because the Big Apple agency was still “stubbornly” trying to fight back.\nThe CDC had strict criteria for testing in part because of the limited ability to test, Weiss said.\nOn Jan. 29, 2020, a Brooklyn hospital reported a patient who was a ride-share driver in his late 40s who was very sick and on a ventilator. Tests for influenza and RSV were negative, but he wasn’t tested for COVID.\n“Although the patient himself didn’t travel, he had exposure to travelers. … I was voted down and the patient wasn’t tested, well, not until several months later,” Weiss said.\nIt turned out that the ride-share driver had COVID. He had underlying ailments and died from COVID-related issues in May 2021.\nNearly 240 suspected COVID-19 cases were reported to the city’s Health Department before the first COVID case was confirmed March 1, 2020.\n“COVID-19 was clearly circulating in NYC a month before the first recognized positive case,” Weiss wrote. “The delay in testing capacity resulted in delayed recognition of  the circular virus, which impaired the public health response until well after community transmission was established.”\nWeiss, in a subsequent interview with The Post about his book, said, “There’s a possibility we would have saved lives” if COVID transmission had been detected sooner.\nAt the very least, residents could have been warned to quarantine and wear masks to protect themselves and others, he said.\nNeither the CDC nor New York City Health Department responded to The Post’s requests for comment.\nWeiss was enraged when de Blasio mentioned a child in The Bronx who tested positive for COVID-19 –revealing enough information that the kid was identified.\n“The child became the target of abuse from classmates and the community. … We were outraged and vowed not to share any more information that could repeat the cruelty we witnessed,” Weiss wrote.\nHe told The Post that city Health Department staffers actually donated money to the student.\n“Contact tracing in NYC was ineffective at slowing transmission of COVID-19. Anyone who claims differently is putting lipstick on a pig,” Weiss said.\nHe said the screening of students at school for COVID-19 was also overused.\nIt’s fair to argue that it was appropriate to try different strategies to help tame a once-in-a-century pandemic, Weiss said.\n“But the tenacity with which the city stuck with ineffective strategies can’t be justified,” he said. “We need to move toward a more tolerable balance of individual freedom and community protection.”\nData show 46,879 deaths in the city have been associated with COVID-19 and its variants since the original outbreak. There have been roughly 3.7 million total cases of COVID and 241,203 hospitalizations in the Big Apple. \nWeiss retired in 2023 after being reassigned over he said was him calling out political correctness run amok.", "link": "https://nypost.com/2025/03/16/us-news/nyc-health-officials-missed-early-covid-spread-by-following-cdc-bureaucrats/", "image": "D:\\Desktop\\MyNews\\article_5.png"}, {"title": "GOP rep, Elon Musk push to impeach judge who scuttled Trump’s order to rapidly deport Venezuelan gangbangers", "summary": "US District Judge James Boasberg blocked President Trump's use of the 18th century Alien Enemies Act against migrant gang members.", "fullstory": "A federal judge who temporarily blocked President Trump’s bid to rapidly deport Venezuelan gang members via the 18th century Alien Enemies Act is facing an impeachment push — including by Elon Musk.\nShortly after the judge’s temporary order was issued, Rep. Brandon Gill (R-Texas) announced plans to file articles of impeachment against the judge, drawing praise from Musk.\n“Necessary,” Musk wrote on X after Gill revealed his plans to introduce articles of impeachment against the judge. \nEarlier in the day Saturday, US District Judge James Boasberg imposed a 14-day restraining order on Trump’s ability to use the 1798-era Alien Enemies Act to bypass the traditional immigration and criminal avenues in order to rapidly deport members of the notorious Venezuelan prison gang Tren de Aragua.\nBoasberg, who was appointed by President Barack Obama in 2011, further ordered “any plane containing these folks that is going to take off or is in the air needs to be returned to the United States however that is accomplished.”\nBut the order already came too late for some suspected gang members. On Sunday, Salvadoran President Nayib Bukele posted dramatic video footage showing more than 250 Tren de Aragua and MS-13 members who were sent to the Central American country. \nThey will be held at the country’s notorious Terrorism Confinement Center (CECOT), as part of a deal Bukele struck with Secretary of State Marco Rubio.\nThe judge’s temporary order came mere hours after Trump took executive action to invoke the 18th-century Alien Enemies Act and begin targeting members of the Venezuelan gang.\nMusk, 53, has previously groused about federal judges who have held up or scuttled various actions by the Trump administration, particularly rulings that have hamstrung the Department of Government Efficiency’s (DOGE) efforts to root out waste.\nGill, 31 is a freshman congressman who recently championed a petition to deport Rep. Ilhan Omar (D-Minn.) — despite her being an American citizen — and introduced legislation to put Trump’s face on the $100 bill.\nThe Alien Enemies Act gives the president wartime powers to apprehend and expel citizens of an enemy country back home. \nBack in January, Trump had designated Tren de Aragua as a terrorist organization. The transnational criminal has been linked to human trafficking, drug smuggling, kidnappings and more in dozens of states, including New York.\nIn his January proclamation, Trump declared that Tren de Aragua and MS-13, “present an unusual and extraordinary threat to the national security, foreign policy, and economy.”\nHis decision to invoke the Alien Enemies Act marked the fourth time that wartime power was used, with the most recent instance being under former President Franklin D. Roosevelt in the wake of the Japanese attack on the Pearl Harbor naval base.\nRoosevelt used that power to put people of Japanese, German and Italian descent into internment camps.\n“Over the years, Venezuelan national and local authorities have ceded ever-greater control over their territories to transnational criminal organizations, including TdA,” Trump explained in a statement on his decision to invoke the authority. \n“The result is a hybrid criminal state that is perpetrating an invasion of and predatory incursion into the United States, and which poses a substantial danger to the United States.”\nBoasberg’s temporary pause on Trump’s use of the Alien Enemies Act came after an emergency hearing Saturday over a lawsuit filed by the American Civil Liberties Union and Democracy Forward, which sued over the deportation of five Venezuelans. \n“I do not believe I can wait any longer and am required to act,” Boasber said Saturday. \nHis temporary pause was intended to give the courts time to further weigh the issue and rule on the lawsuit. \nThe Trump administration has already appealed Boasberg’s order to the DC Circuit Court of Appeals.", "link": "https://nypost.com/2025/03/16/us-news/judge-who-blocked-trumps-alien-enemies-order-faces-impeachment-push-by-gop-rep-musk/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F2023-boasberg-starts-seven-year-100519440_f4d183.jpg?quality%3D90%26strip%3Dall"}, {"title": "Trump narrows Keith Kellogg’s role to Special Envoy to Ukraine, ending his involvement with Russia", "summary": "High-ranking Russian officials complained Kellogg, 80, appeared too sympathetic to Kyiv.", "fullstory": "President Trump announced retired Gen. Keith Kellogg will shift his focus to Ukraine – narrowing his special envoy role to exclude his involvement with Russia as previously planned.\nKellogg, who was initially appointed as Trump’s Special Envoy for Ukraine and Russia, will now serve as Special Envoy to Ukraine, the commander in chief said in a Truth Social post Saturday afternoon. \n“I am pleased to inform you that General Keith Kellogg has been appointed Special Envoy to Ukraine,” Trump, 78, wrote.\n“General Kellogg, a Highly Respected Military Expert, will deal directly with President Zelenskyy, and Ukraine leadership. He knows them well, and they have a very good working relationship together. Congratulations to General Kellogg!”\nAlthough Trump did not explicitly say Kellogg would be removed from negotiations with Russia, the highly decorated general was recently sidelined from top-level peace talks, including Tuesday in Saudi Arabia where US officials and Ukraine agreed to a proposed 30-day ceasefire.\nRussian President Vladimir Putin nixed that deal Thursday, however, and demanded the West stop arming Kyiv, along with other conditions, before the Kremlin would consider such an arrangement.\nThe three-star general thanked Trump for his new role.\n“I am deeply honored and humbled by President Trump’s confidence in appointing me as Special Envoy to Ukraine,” Kellogg, 80, wrote on X.\n“I have been privileged to have known @realdondaldtrump since 2015, and he will END THIS WAR. It is an honor to serve our great nation and advance the vital interests of the United States. America First!”\nThe retired Army lieutenant general co-authored a research paper last April calling for the US to use military aid to Kyiv as leverage to push peace talks with the Kremlin.\nThe paper called for “a formal U.S. policy to bring the war to a conclusion.”\n“Specifically, it would mean a formal U.S. policy to seek a cease-fire and negotiated settlement of the Ukraine conflict. The United States would continue to arm Ukraine and strengthen its defenses to ensure Russia will make no further advances and will not attack again after a cease-fire or peace agreement.\n“Future American military aid, however, will require Ukraine to participate in peace talks with Russia,” the paper said.\nKellogg served in a number of positions during Trump’s first term, including as national security adviser to then-Vice President Mike Pence.", "link": "https://nypost.com/2025/03/15/us-news/trump-narrows-keith-kelloggs-role-to-special-envoy-to-ukraine-ending-his-involvement-with-russia/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fkeith-kellogg-us-special-envoy-100534922.jpg?w%3D1024"}, {"title": "Trump invokes 18th century Alien Enemies Act to declare invasion of Tren de Aragua, speed deportations", "summary": "Claiming the United States was being invaded by a Venezuelan gang, President Donald Trump on Saturday invoked the Alien Enemies Act of 1798.", "fullstory": "President Trump’s mission to stop migrants from entering the US illegally took a step further Saturday, as he signed off on a presidential action invoking a 1798 law called the Alien Enemies Act.\nThe president’s proclamation is meant to target members of Tren de Aragua, a Venezuelan prison gang, and should accelerate deportations of Venezuelans 14 and older who aren’t U.S. citizens or those with green cards.\nThe proclamation’s language contends Venezuelan nationals are now “liable to be apprehended, restrained, secured, and removed as Alien Enemies.” \nTrump signed a presidential order in January, designating Tren de Aragua a foreign terrorist organization, clearing a path for immigration officials to start rounding up its members for removal.\nThe gang, as well as El Salvadoran criminal organization MS-13, “present an unusual and extraordinary threat to the national security, foreign policy, and economy,” the proclamation reads.\nPrior to today, the Alien Enemies Act had only been utilized four times. President Franklin D. Roosevelt was the last president to do so following the attack on the Pearl Harbor naval base, dragging the US into World War II.\n\n\t\t\t\t\tMorning Report and Evening Update: Your source for today's top stories\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\tPlease provide a valid email address.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\tBy clicking above you agree to the \t\t\t\t\tTerms of Use\n\t\t\t\t\t and \t\t\t\t\tPrivacy Policy.\n\t\t\t\t\nThe announcement from the White House followed an emergency hearing held Saturday, after a federal judge paused the deportation of five Venezuelan men under the order. \n“Over the years, Venezuelan national and local authorities have ceded ever-greater control over their territories to transnational criminal organizations, including TdA,” Trump’s statement reads. “The result is a hybrid criminal state that is perpetrating an invasion of and predatory incursion into the United States, and which poses a substantial danger to the United States.”\nTrump’s administration has already appealed Saturday’s ruling.\nTren de Aragua’s origins can be traced back to a Venezuelan prison. \nThe violent gang’s members are said to have blended in with the millions of Venezuelans who’ve exited the South American nation over the last decade, hoping to start anew in America.\nTrump has highlighted the gang’s crimes as validation for his push seeking tighter borders.\nWhile Venezuela claims to have eradicated the gangbaners, Tren de Aragua members have been arrested all over the globe.\nThrough the proclamation, the Trump administration can fast-track deportations without going through normal criminal and immigration channels.\nThe White House said 300 people in US custody have been identified as members of the gang, and could soon be deported to El Salvador.\nThe move will be sure to come under legal scrutiny, as earlier Saturday a federal judge barred the removal of some Venezuelan migrants under the act.\nChief Judge James Boasberg barred the implementation of the act in the case of five migrants from the nation after the American Civil Liberties Union and Democracy Forward fought the move in federal court in Washington, DC. ", "link": "https://nypost.com/2025/03/15/us-news/trump-invokes-18th-century-alien-enemies-act-to-declare-invasion-of-tren-de-aragua-speed-deportations/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F2025-washington-dc-two-leaders-100522096_9817c6.jpg?w%3D1024"}, {"title": "US Sen. Jim Justice’s pet bulldog, Babydog, seen in official government portrait: ‘She makes us smile’", "summary": "\"Babydog represents the genuine enthusiasm and trust West Virginians have in his ability to bring positive change.”", "fullstory": "The chunky English bulldog of US Sen. Jim Justice (R-West Virginia) had her first official government portrait snapped, according to her social media.\nThe 60-pound, tan-and-white pet pooch named Babydog can be seen with her pink tongue poking out over her tiny teeth in the picture, which bears the American and Mountain State flags in the background. \n“Official headshot just dropped,” reads the caption on the photo posted to her X account on Feb. 28.\n“Babydog had the opportunity to take her photo while Senator Justice was taking his official photo. The next step is getting her on the Senate floor as the 101st vote!” said Rachel Harper, Justice’s spokesperson. \nThe doggo – who has been called a “fixture in West Virginia politics” – was a key component of Justice’s Senate campaign last year. \nJustice led the Mountain State as its governor from 2016 to January 2025. \n“With an unwavering belief in Jim’s leadership, Babydog represents the genuine enthusiasm and trust West Virginians have in his ability to bring positive change,” reads the “Meet Babydog” section of Justice’s campaign website. \nBabydog boasts a combined nearly 10,000 followers on X and Instagram, where she is seen in photos sauntering around government buildings, and even palling around with Vice President JD Vance. \n“My favorite things are @JimJusticeWV, Wendy’s nuggets, riding shotgun in dad’s Suburban, and napping,” the bio on her X profile reads. \nAt the Republican National Convention in July, Justice was barely seconds into his address when the audience began thunderously chanting, “Babydog! Babydog! Babydog!” \nHe replied, “I know that a lot of you want to meet my little buddy, so if Babydog could come on out here.” \nTo the adoring Wisconsin crowd’s delight, the stubby bulldog reportedly pranced onto the stage, where she obediently sat on a black leather chair for the remainder of his speech. \n“She makes us smile, and she loves everybody,” Justice said of Babydog, the Washington Post reported at the time. ", "link": "https://nypost.com/2025/03/15/lifestyle/us-sen-jim-justices-pet-bulldog-babydog-seen-in-official-government-portrait-she-makes-us-smile/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fsenator-jim-justices-dog-babydog-100527976.jpg?w%3D819"}, {"title": "Texas nonprofit housing migrant kids took $3B in grants from Biden admin — and boosted executive salaries up to 139% — before Trump pulled plug", "summary": "According to additional internal payment records obtained by The Post, executives and employees at Southwest Key Programs recorded immense six-figure salary surges during the first two years of the Biden administration -- with increases ranging from 10% to as high as 112%.", "fullstory": "WASHINGTON — The biggest housing provider for unaccompanied migrant children nabbed billions of dollars in grants from the Biden administration — and used the massive windfall to boost and even double some executives’ salaries, according to tax filings and records exclusively obtained by The Post.\nSouthwest Key Programs pulled down roughly $3 billion in federal taxpayer funds between fiscal years 2021 and 2024, according to data compiled by the US Department of Health and Human Services (HHS), to help shelter and place migrant kids with US sponsors as border crossings hit an all-time high under President Joe Biden.\nOver roughly the same period, the Austin, Texas-based nonprofit’s higher-ups also raked in much higher take-home pay — with the group’s president disclosing a whopping 139% increase, per the latest tax filings.\nAt the same time, Southwest Key was hit with investigations — and a federal lawsuit — that alleged some migrant kids in its care were sexually abused by employees or else handed over to traffickers.\nAnselmo Villarreal, who became the group’s president and CEO in February 2021, was paid $491,642 over the course of that first fiscal year — but saw his compensation skyrocket to $1,174,551 by fiscal year 2023.\nOther Southwest Key executives — including chief human resources official Jose Arroyo Davila and its chief information officer Andy Harper — saw their salaries doubled, to the $600,000 range.\nEric Marin, the organization’s CFO, earned $349,232 in fiscal year 2021, but his successor, Roberto Flores, took down $583,139 two years later.\nAnother good earner, Geraldo Rivera, the senior VP of immigration services and later chief program officer, surged from $312,791 to $555,998 the year before Biden left office.\nAccording to additional internal payment records obtained by The Post, those executives and a dozen other top employees at Southwest Key recorded those six-figure salary surges during the first two years of the Biden administration — with increases ranging from 10% to as high as 112%.\nSouthwest Key Programs chief of staff Christina Cantu, for example, was making only $86,300 in 2019. By fiscal year 2022, Cantu’s income was recorded at $326,228.\nAn HHS Office of Inspector General report in September 2020 had also already found Southwest Key improperly padding their executives’ pockets with higher pay and bonuses.\nOn average, the top five executive salaries recorded in forms filed with the IRS spiked from $420,000 to $720,000 between 2021 and 2023 — even as its finances were in the red by millions of dollars for two of those three fiscal years.\nThose pay hikes also came as a handful of Southwest Key officials — including its top lobbyist Vivian Panting — were sending small-dollar donations to Democratic campaign funds.\nAnother vice president at the organization, Veronica Delgado-Savage, contributed more than $700 to Biden’s and then Vice President Kamala Harris’ 2024 campaign and associated PAC, FEC records show. Her income during their administration rose from $297,792 to $326,086.\nSouthwest Key’s upward-trending pay under Biden was first reported on by The Free Press in May 2024, before the group’s 2023 filings were made public.\nBiden’s HHS doled out roughly half of the $6 billion in taxpayer funding the nonprofit has taken in since 2003 — but the cash infusion didn’t improve outcomes for the children in its care.\nThe Justice Department sued Southwest Key Programs last July, accusing some supervisors and employees of “severe” and “pervasive” rape and sex abuse of the kids between 2015 and 2023.\nCongressional investigations had also uncovered evidence that the organization placed the migrant kids who entered the US with unvetted sponsors who allegedly trafficked or exploited them.\n“Not only did the Biden-Harris administration create the worst border crisis in American history — it empowered opportunistic nonprofits like Southwest Key Programs and Endeavors to profit off it,” House Homeland Security Committee Chairman Mark Green (R-Tenn.) told The Post.\n“This Congress, the Homeland Security Committee has continued uncovering the Biden administration’s use of taxpayer funds to fuel its border boondoggle,” added the chairman, whose panel uncovered some of the non-governmental groups that hit pay dirt.\n“We remain committed to ensuring the federal government is a good steward of taxpayers’ hard-earned money and will be vigilantly pursuing those who unduly profited at the expense of innocent Americans.”\nSen. Chuck Grassley (R-Iowa) wrote a letter to Villarreal last year informing him of some of the astounding whistleblower testimonies that have been submitted to his office documenting “possible child-trafficking rings” among those sponsors.\nOne of the whistleblowers revealed that a migrant child had been shuttled to a house with “likely MS-13” gang-affiliated members.\nSouthwest Key only produced “lazy and obstructive” responses to records requests, according to another letter Grassley fired off on Monday.\nTrump’s DOJ withdrew from its civil case against Southwest Key on Wednesday, however, and HHS announced in a statement Wednesday that it will no longer fund the Texas nonprofit.\n“Out of continuing concerns relating to these placements, HHS has decided to stop placement of unaccompanied alien children in Southwest Key facilities, and to review its grants with the organization,” noted the public health agency, which coordinated with the Department of Homeland Security to handle the influx of migrant children.\n“In view of HHS’ action, the Department of Justice has dismissed its lawsuit against Southwest Key.”\nA spokesperson for Southwest Key Programs said in a statement Wednesday that the group was “pleased” about the case’s dismissal and “strongly denied the claims relating to child sexual abuse in our shelters.”\n“There is no settlement or payment required,” the spokesperson added, before blaming a Trump admin-imposed government funding freeze for 5,000 layoffs.\nA spokeswoman for Grassley told The Post Friday: “It is disgusting that vulnerable children suffered sexual abuse under Southwest Key’s watch. Senator Grassley has contacted the DOJ seeking clarity regarding its dismissal of the Southwest Key lawsuit, and looks forward to a follow-up conversation soon.”\nAccording to an August 2024 report from DHS’ inspector general, at least 32,000 migrant kids went missing in the US after being released by Immigration and Customs Enforcement, which coordinated with HHS on sponsor placement in the US.\nAnother 291,000 were released to the domestic sponsors, not all of whom were properly vetted after DHS and HHS reached an agreement to no longer require “biographic and biometric (fingerprints) information for all potential sponsors and adult members of their household,” the report found.\nAs border crossings climbed in 2022, Biden’s HHS Secretary Xavier Becerra had also been pressuring staff to release migrant children to sponsors as quickly as possible, likening the ideal turnover rate to an “assembly line,” The New York Times reported.\n“This administration is working fearlessly to end the tragedy of human trafficking and other abuses of unaccompanied alien children who enter the country illegally,” HHS Secretary Robert F. Kennedy, Jr. said of the termination of Southwest Key Programs grants on Wednesday.\n“For too long, pernicious actors have exploited such children both before and after they enter the United States. Today’s action is a significant step toward ending this appalling abuse of innocents.”\nA rep for Southwest Key Programs did not respond to requests for comment.", "link": "https://nypost.com/2025/03/16/us-news/texas-nonprofit-housing-migrant-kids-took-3b-in-grants-from-biden-admin-before-trump-pulled-plug/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F100469830.jpg?w%3D1024"}, {"title": "Democrats’ approval ratings sink to historic lows amid infighting: poll", "summary": "Dems are now held in lower esteem than lawyers, undertakers and car salesmen.", "fullstory": "Democrats have become so unpopular that more Americans believe that aliens are among us than agree with the Democratic Party.\nDems are now held in lower esteem than lawyers, undertakers, and car salesmen.\nTwo punishing new polls released Sunday show that the party has hit historic new lows in approval ratings nationwide — with just 27% of Americans saying they like the job Democrats are doing, according to NBC News.\nA CNN poll put favorability at 29% — the lowest rating in the 33-year history of the survey; 54% have an unfavorable view.\nAnd neither of those polls take into account the party’s latest meltdown.\nDemocrats are now mired in back-biting strife over Senate Minority Leader Chuck Schumer’s decision not to block a Republican budget bill to avert a partial government shutdown.\nEven a lot of Democrats don’t like the Democrats these days — just 63% of Dems reported having a favorable view of the party, down 18 points from 81% four years ago, during the start of the Biden administration, according to CNN.\nThe tough poll numbers for Dems come as Trump’s approval rating hit an all-time high of 47%, per the NBC News poll. Republicans in general, are faring much better, with a 36% favorability rating, the CNN poll found.\nMost Dem voters believe that top party brass is steering Democrats in the wrong direction, CNN found.\nAnd now it’s spilling over — with congressional Democrats openly sniping at Schumer over his decision.\n“The idea that Chuck Schumer is the only one that’s got a brain in the room and the only one that can think through all of the pros and cons is absolutely ridiculous,” Rep. Jasmine Crockett (D-Texas) fumed on CNN’s “State of the Union” Sunday.\nModerate and progressive Democratic lawmakers alike felt that the government shutdown fight was the only major leverage against Republicans that they would have for months.\nPresident Trump, who enjoys unprecedented executive power along with majorities in both chambers of Congress, has run roughshod over the Democrats with a flurry of executive activity in his first 50 days in office.\nCritics of Schumer’s decision wanted to use that fight to extract concessions from the GOP on the Department of Government Efficiency (DOGE) and the spending cuts that Republicans are planning.\nSchumer, however — along with nine other Democrats — declined to block the GOP bill, saying they believed that allowing the government to shut down would be a loser for the party.\nProgressive activists erupted in outrage, and groups such as Indivisible promptly called on Senate Dems to oust the New Yorker from his longtime post.\nA Change.org petition to cease donations to the Dems until Schumer steps down quickly garnered over 21,000 signatures. \n“They blew it! The Democratic Tea Party was born the same day that Chuck Schumer took to that podium to read that very well-crafted statement that told us he folded like a paper napkin,” Symone Sanders-Townsend, a former Harris-aide, turned MSNBC host chided Saturday.\nDemocratic leadership appears to be splintering over the party’s direction as well.\nIn a stunning rebuke from a fellow Brooklyn native, House Minority Leader Hakeem Jeffries (D-NY) refused to say whether he had confidence in his Senate counterpart or whether Schumer should be replaced, illustrating the palpable level of frustration among Dems.\n“Next question,” Jeffries said during a press conference when asked about Schumer’s future as leader of the Senate Dems. \nSo far, Democratic lawmakers have steered clear of publicly calling for Schumer to be booted as the No. 1 Senate Dem, though murmurs about his future have spread in private, according to Politico.\n“I think it is a huge slap in the face, and I think that there’s a wide sense of betrayal if things proceed as currently planned,” Rep. Alexandria Ocasio-Cortez (D-NY), who has been pressured by some progressives to mount a primary challenge against Schumer, told NewsNation last week\nOther Senate Democrats have not been shy about ripping into Schumer’s approach to the shutdown scrum, either.\n“Americans want the Democratic Party to stand up and fight and to take risks,” Sen. Chris Murphy (D-Conn.) told NBC’s “Meet the Press ” on Sunday. “If we continue to work with Republicans, if we continue to hand Donald Trump more power, we are going to lose our democracy.”\nPolling echoes Murphy’s point, with some 57% of Democrats and aligned Independents wanting the party to focus on countering the GOP agenda instead of partnering with Republicans on bipartisan proposals, according to the CNN survey. \nThat’s a sharp turnaround from eight years ago, when 74% of Democratic-leaning voters wanted the party to focus on bipartisanship with Republicans rather than focus on fighting the GOP, per the CNN poll. \nSignificantly, that poll came before Schumer and nine other Democrats refrained from blocking the GOP bill to forestall a partial government shutdown. \nSchumer has shrugged off the backlash. Having spent over a quarter century in the Senate and nearly two decades in the House, he’s lived through multiple government shutdowns and did not feel his party was positioned to win this one.\n“It would be a disaster,” Schumer had warned about a partial shutdown. “And we have to alert everyone how much pain it would cause the American people.”\nTrump and Republicans have sought to put salt in Schumer’s wounds by publicly lauding his efforts to avert a shutdown, knowing full well how progressives will interpret that.\n“AOC has a lot to learn from Chuck Schumer. He did the right thing for America and New York,” White House spokesperson Alex Pfeiffer needled about the Democratic infighting. \nConsternation about Democratic leadership goes deeper than the shutdown row. \nSince Trump’s return to the White House, Democrats have struggled to navigate his return, with disputes between moderates and progressives over how to calibrate messaging and whether the party should lurch towards the center.\nThis past month, for example, California Gov. Gavin Newsom (D) stoked controversy by suggesting that transgender competition in women’s sports is unfair, rankling elements of his base.\nThe CNN poll sampled 1,206 adults between March 6–9 and was taken by SSRS with a margin of error of plus or minus 3.3 percentage points. The poll included a subsample of 504 Democratic-leaning voters, which had a margin of error of plus or minus 5 percentage points.", "link": "https://nypost.com/2025/03/16/us-news/democrats-favorability-craters-to-record-low-poll/", "image": "D:\\Desktop\\MyNews\\article_6.png"}, {"title": "Ukrainian allies urging Putin to accept US cease-fire proposal, commit to post-war security", "summary": "A coalition of Ukrainian allies agreed Saturday to keep the \"collective pressure\" on Russia to accept President Trump's ceasefire proposal and commit to supporting Ukraine if it is achieved.", "fullstory": "A coalition of Ukrainian allies agreed Saturday to keep the “collective pressure” on Russia to accept President Trump’s ceasefire proposal, as they vowed to protect the embattled nation “on the land, at sea, and in the sky” once a deal is reached. \nThe leaders of 26 countries –  dubbed the “coalition of the willing” — took part in a virtual summit led by UK Prime Minister Keir Starmer as the group plans to move toward an “operational phase” to secure a ceasefire.\n“President Trump has offered Putin the way forward to a lasting peace,” Starmer said after the meeting, which included leaders from Europe,  Australia, Canada and New Zealand — but not the US. “Now we must make this a reality.”\n“Sooner or later Putin will have to come to the table,” he added.\nThe coalition will meet again in Britain on Thursday to put forward plans to ensure Ukraine’s security should a peace deal be hammered out.\nStarmer vowed the group will “help secure Ukraine on the land, at sea, and in the sky” and keep pressuring Russia with sanctions.\nThe Trump administration has long called for European nations to help shoulder the burden for the conflict in Ukraine and provide plans on post-war support.\nRussian President Vladimir Putin met with US envoy Steve Witkoff Thursday to discuss a US proposal for a 30-day ceasefire, which Kyiv has already backed.\nPutin said he supports a truce in principle but had a laundry list of conditions he says must be met before the fighting stops. \nAmong them, he wants Ukraine to drop its ambitions to join NATO, shrink the size of its army and hand over the four territories Russia has annexed — all of which Kyiv has refused.\nAt a press conference Saturday, Zelensky said the question of territory was “complicated” and should be dealt with later. \nHe pressed allies to give a “clear position” on security guarantees and said Russia was working to gain a “stronger position” militarily before agreeing to a ceasefire.\nAfterwards, Zelensky told the European leaders on X, “the path to peace must begin unconditionally. If Russia doesn’t want this, then strong pressure must be applied until they do.”\n“A cease-fire could have already happened, but Russia is doing everything to prevent it,” he added.\nTrump expressed optimism Friday after US envoy Steve Witkoff held productive ceasefire talks in Moscow the day before, saying  there was a “very good chance” the war could finally come to an end.\nUkraine and Russia, meanwhile, ratcheted up aerial assaults overnight Saturday, exchanging hundreds of drones that caused extensive damage in both territories.\nRussia attacked Ukrainian energy facilities and knocked out electricity for residents in two cities, according to officials. \nFalling drone debris in southwestern Russia sparked a fire near an oil refinery, causing nearby airports to temporarily halt flights, according to reports.", "link": "https://nypost.com/2025/03/15/world-news/ukrainian-allies-urging-putin-to-accept-us-cease-fire-proposal-commit-to-post-war-security/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fprime-minister-sir-keir-starmer-100511707.jpg?w%3D1024"}, {"title": "Cuomo used damaging big-foot tactics, secrecy in dealing with NYC officials battling COVID: scathing study", "summary": "Mayoral candidate and then-Gov. Andrew Cuomo used heavy-handed tactics and secretiveness with Big Apple officials as the city struggled to contain the deadly COVID pandemic, a scathing new study says.", "fullstory": "Mayoral candidate and then-Gov. Andrew Cuomo used heavy-handed tactics and secretiveness with Big Apple officials as the city struggled to contain the deadly COVID pandemic, a scathing new study says.\nEx-Mayor Bill de Blasio also gets dinged in the report, which was issued by several city agencies that analyzed New York City’s handling of the health crisis — and which specifically criticized the toxic relationship between him and Cuomo.\n“Coordination challenges between Governor Cuomo’s and Mayor de Blasio’s administrations impeded City-State collaboration and contributed to duplicative work, inconsistent recommendations, and a loss of trust from New Yorkers,” says the COVID-19 Response Review Report covering January 2020 to July 2022 and obtained by The Post.\nThe analysis was prepared by city agencies — notably the Health Department, Office of Emergency Management and Health+Hospitals — serving under Cuomo’s now-mayoral foe, Hizzoner Eric Adams.\nCuomo was accused in the report of big-footing City Hall and unnecessarily micro-managing the city’s response.\n“The Cuomo administration was reluctant to share data with the City and often refused to give advance warning of policy changes and new directives,” the study said.\nFor example, in March 2020, the state restricted the city’s access to its Health Emergency Response Data System (HERDS), which tracks hospital capacity across New York state, though the city historically had regular access.\n“This limited the City’s insight into hospital impacts and hindered its ability to support the NYC healthcare system,” the report said.\nDon Weiss, the former longtime “surveillance director” for the city Health Department, said state Health Department officials he worked with for years told him they weren’t supposed to share information.\n“It was because of the pissing contest between Cuomo and de Blasio. It was ludicrous,” he said.\nA former state official said Cuomo’s “strong dislike” of de Blasio certainly was an issue but that officials in Albany and City Hall still found “creative ways” to quietly work together despite the chill between the two power brokers.\nState officials were also “slow to release critical pandemic-related guidance,” the report said — resulting in the city either releasing its own guidance or policy which would later be superseded by the state.\nThe confusion “significantly impacted healthcare operations early in the pandemic,” the report said. \nThe disharmony spilled over into the crucial COVID-19 vaccine distribution period, the findings said.\nThe city obtained its COVID-19 vaccine supply directly from the federal Centers for Disease Control, as it had other vaccines.\nBut unlike previous vaccine campaigns, state approval was required for the city’s vaccine allocation and the Big Apple’s distribution plan each week, which “created an additional bureaucratic layer,” the report said.\nA former state official who requested anonymity said Albany “micro-managed” the city’s vaccination program. \nThe study also pointed to “state and city guidance contradictions” as creating serious issues.\nDe Blasio publicly announced plans to close schools and non-essential businesses because of a COVID-19 surge in parts of Brooklyn and Queens in October 2020.\nBut Cuomo, who had the authority to impose such measures, rejected the mayor’s plan and announced his own geographical areas and closures for the city to enforce, the report said.\nBronx state Sen. Gustavo Rivera, chairman of the New York Senate’s Health Committee, said Cuomo’s “big-footing everybody” was one of the reasons he voted against legislation giving the governor emergency powers without reporting back to the legislature.\n“He’s an abusive bully,” said Rivera, a Democrat along with Cuomo and Adams.\nCuomo defended his oversight of the pandemic in the city as governor.\n“Feeble attempts to rewrite history now — five years later — in the midst of a political campaign are as ineffective as they are disingenuous,” the former governor’s spokesman, Rich Azzopardi, told The Post. “New Yorkers know what happened because they were there with us every step of the way.\n“Decisions were made and communicated in real time as the facts on the ground kept changing and lines of communication with local governments, including the city, were open to the largest extent practical.”\nThe Cuomo rep said a strong state presence was needed to aid the city.\n“What’s forgotten here is that the entire reason a uniform hospital system was set up in the first place was because Elmhurst, a city-run hospital, nearly collapsed and there was no plan from the city to redirect patients,” Azzopardi said.\n“The city needed a manager then, and it does now. This was a once-in-a century pandemic and one would think any objective retrospective would be devoid of politics or political campaigns.”\nBut Gustavo also claimed Cuomo blocked vaccine clinics from opening his district to spite him, potentially triggering more deaths from COVID-19.\nThe Cuomo campaign fired back with a list of five vaccination sites in the northwest Bronx in 2021.\n“Gustavo is a liar. The facts are the facts,” Azzopardi said.\n“He’s trying to block and tackle for his [Democratic Socialists of America] buddies.” ", "link": "https://nypost.com/2025/03/16/us-news/cuomo-used-damaging-big-foot-tactics-secrecy-in-dealing-with-nyc-officials-battling-covid-scathing-study/", "image": "D:\\Desktop\\MyNews\\article_7.png"}, {"title": "Trump orders ‘powerful’ attack on Iranian-backed Houthi rebels in Yemen", "summary": "The president sent a direct message to the militia group, writing in the post, “YOUR ATTACKS MUST STOP, STARTING TODAY.”", "fullstory": "President Trump unleashed “hell” on  Iranian-backed Houthis  on Saturday, striking  dozens of  targets in  Yemen  in response to the terror group’s attacks on Red Sea shipping.\n“Today, I have ordered the United States Military to launch decisive and powerful Military action against the Houthi terrorists in Yemen,” Trump wrote in a Truth Social post announcing the strikes. \n“They have waged an unrelenting campaign of piracy, violence, and terrorism against American, and other, ships, aircraft, and drones,” he continued.\nTrump sent a direct message to the  group in his post:  “YOUR ATTACKS MUST STOP, STARTING TODAY.\n“IF THEY DON’T, HELL WILL RAIN DOWN UPON YOU LIKE NOTHING YOU HAVE EVER SEEN BEFORE!”\nThe US will use “overwhelming lethal force to achieve its objective,” Trump added.\nIran’s support for its proxy must end “immediately,” Trump warned, cautioning the country not to threaten the US or international shipping lanes.\n“If you do, BEWARE, because America will hold you fully accountable and we won’t be nice about it!” Trump said.\nAt least nine people were killed and another nine were injured in initial strikes, the Houthi-run health ministry claimed.\nThe strikes were carried out by the USS Harry S. Truman carrier strike group, three Navy destroyers and one cruiser at targets in Sanaa, Yemen’s capital city, according to reports.\nUS Central Command posted video to X of a series of fighter jets taking off from an aircraft carrier as it announced the strikes.\nRadars, air defenses and missile and drone systems Houthis had been using to disrupt shipping lanes in the Red Sea were among the targets, The New York Times reported.\nTrump also took aim at former President Biden in his post, saying his response to the group, which has attacked American warships in the Red Sea “dozens of times” in recent months, was “pathetically weak.”\n“It has been over a year since a U.S. flagged commercial ship safely sailed through the Suez Canal, the Red Sea, or the Gulf of Aden,” Trump said.\nThe Biden administration carried out strikes along with the UK last year in response to Houthis attacking merchant ships and military vessels but failed to bring stability to the region.\nThe Houthis have targeted more than 100 merchant vessels with missiles and drones, sinking two vessels and killing four sailors, since the war between Israel and Hamas began.\nEarlier this week, the Houthis said “any Israeli vessel” traveling through nearby waterways would be “subject to military targeting” in response to Israel cutting off aid to Gaza. \nNo direct threat was made to the US, but the Navy responded it would “do what is necessary to protect and defend U.S. personnel assets and partners.”\nThe military action comes two weeks after Trump sent a letter to Iranian leaders urging talks on Iran’s advancing nuclear weapons program, which Trump has said he will not allow to become operational.\nIran’s Supreme leader Ayatollah Ali Khamenei called the letter “unwise” and a “threat,” according to reports. ", "link": "https://nypost.com/2025/03/15/us-news/trump-orders-powerful-attack-on-houthi-rebels-in-yemen/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fpresident-trump-taking-action-houthis-100551196.jpg?w%3D682"}, {"title": "Fetterman rips AOC for criticizing Dems backing bill preventing government shutdown", "summary": "Sen. John  Fetterman (D-Pa.) is ripping \"Squad\" Rep. Alexandria Ocasio-Cortez over her harsh criticism of Senate Democrats like him who are backing a Republican spending bill being pushed by President Trump to avoid a government shutdown.", "fullstory": "Sen. John  Fetterman (D-Pa.) fired back at “Squad” Rep. Alexandria Ocasio-Cortez over her criticism of Senate Democrats like him who are backing the GOP spending bill that will avoid a government shutdown.\nFetterman — who has increasingly broken with Democratic ranks to side with President Trump on key issues — said Ocasio-Cortez and other lefty lawmakers calling for the Senate to block a bill that would fund the government through Sept. 30, don’t have a viable option to prevent a shutdown either.\n“I hope you can relay how little I care about her views on this,” Fetterman told The Hill Friday when asked about Ocasio-Cortez’s claim that Senate Dems who vote to advance the bill are betraying their House colleagues who voted against it.\n“I’m going to stand on what I happen to believe is the right thing to do but ask her, ‘What’s the exit plan once we shut the government down?’ What about all the millions of Americans who are going to have their lives damaged?” he said.\n“What about the ones that won’t have any paycheck? She’ll have her paycheck, though.”\nOcasio-Cortez told reporters Thursday that many Democrats felt a “deep sense of outrage and betrayal” over Senate Democratic Minority Leader Chuck Schumer’s announcement that he’ll vote to advance the House-passed funding plan.\n“While the bill is very bad, the potential for a shutdown has consequences for America that are much, much worse,” Schumer declared in a Senate floor speech Thursday. “Allowing Trump to take even much more power is a far worse option.”\nMany furious Democrats are now pushing Ocasio-Cortez to primary Schumer in response to his decision.", "link": "https://nypost.com/2025/03/15/us-news/fetterman-rips-aoc-for-criticizing-dems-backing-billl-to-avoid-government-shutdown/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fsen-john-fetterman-d-pa-100522044.jpg?w%3D1024"}, {"title": "Fed judge orders deportation flights carrying alleged Venezuelan gangbangers to return to US, blocks Trump from invoking Alien Enemies Act", "summary": "It comes as Trump made efforts late Saturday to expand the use of the order to deport migrant gang members nationwide.", "fullstory": "A federal judge temporarily blocked President Trump on Saturday from invoking the 18th century Alien Enemies Act to swiftly deport alleged Venezuelan gang members without a hearing – ordering any flights carrying the supposed criminals to turn around.\nUS District judge James Boasberg quickly ordered the Trump administration to halt all removals after the commander in chief signed off on a presidential action invoking the 1798 law – aimed at targeting Venezuelan prison gang Tren de Aragua, The Washington Post reported.\nThe chief judge in the District of Columbia said he heard that “flights are actively departing” and directed US officials to have planes in the air carrying migrants returned to the United States, the outlet reported.\n“Any plane containing these folks that is going to take off or is in the air needs to be returned to the United States however that is accomplished,” Boasberg reportedly wrote. \nThe temporary ruling will put a 14-day restraining order on use of the wartime act, which the Trump administration hopes to use to deport any migrant it identifies as a gang member without following normal criminal and immigration channels. \nA new hearing has been scheduled for Friday as a pause will be put in place for those deported under the Alien Enemies Act.\n“I do not believe I can wait any longer and am required to act,” Boasber said during a hearing Saturday night. \n“A brief delay in their removal does not cause the government any harm,” he said, noting that the detainees will remain in government custody. \nBoasberg’s ruling came in response to a lawsuit filed by the American Civil Liberties Union and Democracy Forward challenging the removal of five Venezuelan men under the centuries-old law — which was reportedly signed on Friday.\nBefore the early evening ruling blocking the use of the act, an emergency hearing was held Saturday morning. At it the judge barred the removal of the five migrants named in the legal challenge, which Trump’s administration has already appealed.\nThe Alien Enemies Act has only been used three times before in American history, all during wartime. President Franklin D. Roosevelt was the last president to do so following the attack on the Pearl Harbor naval base, dragging the US into World War II.\nThe act was used by the Democrat’s administration to justify internment camps for people of Japanese, German and Italian descent.\nTrump’s proclamation’s language, however, contends the gang is effectively at war with the United States and Venezuelan nationals are now “liable to be apprehended, restrained, secured, and removed as Alien Enemies.”\n“Over the years, Venezuelan national and local authorities have ceded ever-greater control over their territories to transnational criminal organizations, including TdA,” Trump’s statement reads. \n“The result is a hybrid criminal state that is perpetrating an invasion of a predatory incursion into the United States, and which poses a substantial danger to the United States.”\nTren de Aragua’s origins can be traced back to a Venezuelan prison. \nThe violent gang’s members are said to have blended in with the millions of Venezuelans who’ve exited the South American nation over the last decade, hoping to start anew in America.\nTrump has highlighted the gang’s crimes as validation for his push seeking tighter borders.\nThe White House said 300 people in US custody have been identified as members of the gang, and could soon be deported to El Salvador.\nTrump signed a presidential order in January, designating Tren de Aragua a foreign terrorist organization, clearing a path for immigration officials to start rounding up its members for removal.", "link": "https://nypost.com/2025/03/15/us-news/fed-judge-orders-deportation-flights-carrying-alleged-venezuelan-gangbangers-to-return-to-us-after-trump-invokes-alien-enemies-act/", "image": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2F2023-boasberg-starts-seven-year-100519440_f3574e.jpg?w%3D1024"}]